http/results/retro2-effects-libev-R20000-r3.txt
Running 20s test @ http://127.0.0.1:19302/
  4 threads and 100 connections
  Thread calibration: mean lat.: 2.442ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 2.708ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 2.701ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 2.903ms, rate sampling interval: 17ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.89ms    3.32ms  20.45ms   84.68%
    Req/Sec     5.17k     1.11k    9.94k    78.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.55ms
 75.000%    2.45ms
 90.000%    8.49ms
 99.000%   14.36ms
 99.900%   17.76ms
 99.990%   20.09ms
 99.999%   20.42ms
100.000%   20.46ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.070     0.000000            1         1.00
       0.755     0.100000        19807         1.11
       0.946     0.200000        39485         1.25
       1.137     0.300000        59257         1.43
       1.339     0.400000        78967         1.67
       1.554     0.500000        98649         2.00
       1.667     0.550000       108576         2.22
       1.796     0.600000       118372         2.50
       1.951     0.650000       128259         2.86
       2.145     0.700000       138098         3.33
       2.447     0.750000       147953         4.00
       2.723     0.775000       152891         4.44
       3.289     0.800000       157817         5.00
       4.843     0.825000       162758         5.71
       6.363     0.850000       167691         6.67
       7.459     0.875000       172625         8.00
       7.979     0.887500       175096         8.89
       8.495     0.900000       177566        10.00
       9.039     0.912500       180030        11.43
       9.615     0.925000       182476        13.33
      10.271     0.937500       184944        16.00
      10.655     0.943750       186197        17.78
      11.015     0.950000       187411        20.00
      11.391     0.956250       188666        22.86
      11.767     0.962500       189884        26.67
      12.255     0.968750       191112        32.00
      12.519     0.971875       191732        35.56
      12.767     0.975000       192353        40.00
      13.055     0.978125       192973        45.71
      13.375     0.981250       193574        53.33
      13.671     0.984375       194198        64.00
      13.839     0.985938       194507        71.11
      14.007     0.987500       194814        80.00
      14.223     0.989062       195121        91.43
      14.455     0.990625       195422       106.67
      14.767     0.992188       195730       128.00
      14.927     0.992969       195882       142.22
      15.119     0.993750       196043       160.00
      15.287     0.994531       196197       182.86
      15.487     0.995313       196346       213.33
      15.735     0.996094       196501       256.00
      15.903     0.996484       196576       284.44
      16.143     0.996875       196655       320.00
      16.319     0.997266       196731       365.71
      16.495     0.997656       196814       426.67
      16.655     0.998047       196889       512.00
      16.783     0.998242       196927       568.89
      16.895     0.998437       196963       640.00
      17.167     0.998633       197001       731.43
      17.407     0.998828       197038       853.33
      17.791     0.999023       197077      1024.00
      17.967     0.999121       197096      1137.78
      18.143     0.999219       197116      1280.00
      18.351     0.999316       197136      1462.86
      18.703     0.999414       197154      1706.67
      19.199     0.999512       197175      2048.00
      19.279     0.999561       197185      2275.56
      19.343     0.999609       197192      2560.00
      19.455     0.999658       197202      2925.71
      19.615     0.999707       197212      3413.33
      19.791     0.999756       197222      4096.00
      19.839     0.999780       197226      4551.11
      19.903     0.999805       197233      5120.00
      19.935     0.999829       197237      5851.43
      19.983     0.999854       197242      6826.67
      20.015     0.999878       197246      8192.00
      20.047     0.999890       197248      9102.22
      20.127     0.999902       197253     10240.00
      20.127     0.999915       197253     11702.86
      20.175     0.999927       197255     13653.33
      20.191     0.999939       197259     16384.00
      20.191     0.999945       197259     18204.44
      20.239     0.999951       197261     20480.00
      20.239     0.999957       197261     23405.71
      20.271     0.999963       197262     27306.67
      20.287     0.999969       197263     32768.00
      20.303     0.999973       197264     36408.89
      20.319     0.999976       197265     40960.00
      20.319     0.999979       197265     46811.43
      20.399     0.999982       197266     54613.33
      20.399     0.999985       197266     65536.00
      20.415     0.999986       197267     72817.78
      20.415     0.999988       197267     81920.00
      20.415     0.999989       197267     93622.86
      20.431     0.999991       197268    109226.67
      20.431     0.999992       197268    131072.00
      20.431     0.999993       197268    145635.56
      20.431     0.999994       197268    163840.00
      20.431     0.999995       197268    187245.71
      20.463     0.999995       197269    218453.33
      20.463     1.000000       197269          inf
#[Mean    =        2.885, StdDeviation   =        3.319]
#[Max     =       20.448, Total count    =       197269]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  393906 requests in 20.00s, 795.64MB read
Requests/sec:  19695.87
Transfer/sec:     39.78MB

JSON Output:
{
	"requests": 393906,
	"duration_in_microseconds": 19999421.00,
	"bytes": 834292908,
	"requests_per_sec": 19695.87,
	"bytes_transfer_per_sec": 41715853.07,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 1554
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 2447
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 8495
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 14359
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 17759
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 20095
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 20415
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 20463
		}
	]
}