http/results/retro2-effects-libev-R20000-r4.txt
Running 20s test @ http://127.0.0.1:19304/
  4 threads and 100 connections
  Thread calibration: mean lat.: 4.554ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 4.841ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.835ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 5.013ms, rate sampling interval: 21ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.26ms    4.86ms  29.58ms   85.78%
    Req/Sec     5.12k     1.16k   10.00k    73.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.01ms
 75.000%    6.00ms
 90.000%   10.78ms
 99.000%   22.77ms
 99.900%   26.74ms
 99.990%   28.86ms
 99.999%   29.57ms
100.000%   29.60ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.071     0.000000            1         1.00
       0.920     0.100000        19746         1.11
       1.205     0.200000        39483         1.25
       1.448     0.300000        59233         1.43
       1.706     0.400000        78979         1.67
       2.013     0.500000        98757         2.00
       2.203     0.550000       108669         2.22
       2.431     0.600000       118449         2.50
       2.839     0.650000       128321         2.86
       3.985     0.700000       138185         3.33
       6.003     0.750000       148073         4.00
       6.799     0.775000       153000         4.44
       7.511     0.800000       157950         5.00
       8.175     0.825000       162860         5.71
       8.879     0.850000       167794         6.67
       9.711     0.875000       172745         8.00
      10.215     0.887500       175214         8.89
      10.783     0.900000       177675        10.00
      11.463     0.912500       180132        11.43
      12.215     0.925000       182607        13.33
      13.103     0.937500       185074        16.00
      13.655     0.943750       186301        17.78
      14.399     0.950000       187547        20.00
      15.439     0.956250       188773        22.86
      16.783     0.962500       190018        26.67
      18.319     0.968750       191241        32.00
      18.975     0.971875       191856        35.56
      19.647     0.975000       192479        40.00
      20.271     0.978125       193094        45.71
      20.735     0.981250       193712        53.33
      21.279     0.984375       194336        64.00
      21.567     0.985938       194629        71.11
      21.983     0.987500       194943        80.00
      22.495     0.989062       195256        91.43
      22.975     0.990625       195562       106.67
      23.647     0.992188       195867       128.00
      23.919     0.992969       196019       142.22
      24.223     0.993750       196176       160.00
      24.527     0.994531       196326       182.86
      24.959     0.995313       196490       213.33
      25.279     0.996094       196638       256.00
      25.471     0.996484       196719       284.44
      25.599     0.996875       196790       320.00
      25.743     0.997266       196868       365.71
      25.887     0.997656       196944       426.67
      26.143     0.998047       197020       512.00
      26.287     0.998242       197058       568.89
      26.383     0.998437       197097       640.00
      26.495     0.998633       197140       731.43
      26.591     0.998828       197173       853.33
      26.783     0.999023       197212      1024.00
      26.863     0.999121       197233      1137.78
      26.959     0.999219       197252      1280.00
      27.151     0.999316       197271      1462.86
      27.375     0.999414       197289      1706.67
      27.551     0.999512       197309      2048.00
      27.663     0.999561       197318      2275.56
      27.791     0.999609       197327      2560.00
      27.903     0.999658       197337      2925.71
      28.063     0.999707       197347      3413.33
      28.255     0.999756       197357      4096.00
      28.383     0.999780       197361      4551.11
      28.511     0.999805       197366      5120.00
      28.591     0.999829       197371      5851.43
      28.687     0.999854       197376      6826.67
      28.767     0.999878       197380      8192.00
      28.847     0.999890       197383      9102.22
      28.879     0.999902       197386     10240.00
      29.039     0.999915       197389     11702.86
      29.055     0.999927       197390     13653.33
      29.119     0.999939       197392     16384.00
      29.167     0.999945       197394     18204.44
      29.183     0.999951       197395     20480.00
      29.199     0.999957       197396     23405.71
      29.215     0.999963       197397     27306.67
      29.231     0.999969       197398     32768.00
      29.247     0.999973       197399     36408.89
      29.279     0.999976       197400     40960.00
      29.279     0.999979       197400     46811.43
      29.343     0.999982       197401     54613.33
      29.343     0.999985       197401     65536.00
      29.567     0.999986       197402     72817.78
      29.567     0.999988       197402     81920.00
      29.567     0.999989       197402     93622.86
      29.583     0.999991       197403    109226.67
      29.583     0.999992       197403    131072.00
      29.583     0.999993       197403    145635.56
      29.583     0.999994       197403    163840.00
      29.583     0.999995       197403    187245.71
      29.599     0.999995       197404    218453.33
      29.599     1.000000       197404          inf
#[Mean    =        4.257, StdDeviation   =        4.856]
#[Max     =       29.584, Total count    =       197404]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  394012 requests in 20.00s, 795.86MB read
Requests/sec:  19697.44
Transfer/sec:     39.79MB

JSON Output:
{
	"requests": 394012,
	"duration_in_microseconds": 20003204.00,
	"bytes": 834517416,
	"requests_per_sec": 19697.44,
	"bytes_transfer_per_sec": 41719187.39,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 2013
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 6003
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 10783
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 22767
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 26735
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 28863
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 29567
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 29599
		}
	]
}